// ts中的一些特殊符号作用
/**
 * 1.  !    非空断言操作符
 * 2.  ?.   可选链
 * 3.  ??   空值合并运算符
 * 4.  ?:   可选属性
 * 5.  &    多种类型叠加
 * 6.  |    多种类型中的一种
 * 7.  _    数字分隔符如1_464_301
 * 8.  <>   ts泛型
 * 9.  @    装饰器语法
 * 10. #    类的私有字段
 * 11. -?   移出可选属性中的'?'
 */

// 高级类型和实用程序
/**
 * 1.  ConstructorParameters    类构造函数的参数类型的元组
 * 2.  Exclude<T, U>            从T中剔除可以赋值给U的类型
 * 3.  Extract<T, U>            提取T中可以赋值给U的类型
 * 4.  NonNullable<T>           从T中剔除null和undefined
 * 5.  ReturnType<T>            获取函数返回值类型
 * 6.  InstanceType<T>          获取构造函数的实例类型
 * 7.  Parameters               函数参数类型的元组
 * 8.  Partial                  将对象中的所有属性设为可选
 * 9.  Required                 将对象中的所有属性设为必须
 * 10. Readonly                 将对象中的所有属性设为只读
 * 11. ReadonlyArray            制作给定类型的不可变数组
 * 12. Pick                     从一个复合类型中，取出几个想要的类型组合
 * 13. Record                   从键类型到值类型的映射
 */
